import pandas as pd
import numpy as np
from tensorflow.keras.preprocessing.text import Tokenizer
from tensorflow.keras.preprocessing.sequence import pad_sequences
from difflib import SequenceMatcher
from eunjeon import Mecab


def similar(a, b):
    return SequenceMatcher(None, a, b).ratio()


def make_X1input(input_list):
    case = ['가스방출', '가정폭력범죄의처', '가중처벌', '가축전염병예방법위반', '간주거침입절도', '간첩', '간통', '감금', '강간', '강도', '강도상해등재범', '강요', '강제집행면탈', '개발제한구역의지정및관리에관한특별조', '개인정보보호법위반', '개항질서법위반', '건조물침입', '게임산업진흥에간한법률위반', '견책처분취소', '경륜경정법위반', '경매방해', '경범죄처벌법위', '고무', '고압가스안전관리법위반', '고용보험법위반', '골재채취법위반', '공갈', '공기명위조', '공기호부정사용', '공동위험행위', '공동재물손괴', '공동퇴거불응', '공동협박', '공무', '공무상비밀누설', '공무원자격사', '공문', '공소취소', '공연', '공익사업을위한토지등의취득및보상에관한법률위반', '공전자기록', '공정증서원본불', '과실', '관세', '교동사고처리득례법위반', '권리행사', '근로기준법위반', '근로자퇴', '기재', '기차교통방해', '내란실행', '노동조합및K계조정법위반', '뇌물', '대마', '대부업등의등록및금융이용자보호에관한', '도검', '도로', '도박', '도주', '독직폭행', '마약류관리에', '매매대금', '메라등이용촬영', '명예훼손', '모욕', '무고', '무면허운전', '무상배임', '무상횡령', '문서손괴', '미성년자간음', '배상명령', '범인도퍼교사', '범인은닉', '법률', '병합', '보건범죄', '보복폭행', '보복협박', '보조금관리에관', '보조금의예산및', '보호관찰명령', '본소', '부당이득금', '부동산실권리자명의등기에관한', '부정식품제조', '부정의료', '부정처사후수뢰', '부착명령', '분리', '사고후미조치', '사기', '사문', '사체은닉', '산림', '산지관', '상습아동학대', '상습장물취득', '상습특수상해', '상해치사', '석유및석유대체', '성매수', '성적목적공공장소침입', '성폭', '세금계산서교부', '소방시설설치', '손해배상', '실종아동등의보호및지원에관한법', '실화', '아동', '아동에대한성희롱', '업무', '업무상위력등에의한추행', '영아살해', '운전자폭행', '위계공', '위계등간음', '위조유가증권수입', '위증', '위헌법률심판제청', '위험물안', '유사수신행위의', '음란물건판매', '음주측정거부', '일반교통', '자격모용사문', '자동', '장물', '장애인간음', '재물', '전기통산금융사기피해금환급에관한특별법위반', '점유이탈물', '정보', '족관계에의한강간', '존속살해', '존속폭행', '존속협박', '주거', '주민등록법', '증거은닉', '집단', '집단흠기등협박', '찬양', '채권의공정한추심에관한', '청구', '초병폭행', '총포', '축산물위생', '치료감호', '컴퓨터등사용사기', '편의시설부정이용', '학원의설립', '향정']
    result = pd.DataFrame(0, index=np.arange(1), columns=case)
    for i in input_list:
        for c in range(len(case)):
            if similar(i, case[c]) > 0.5:  # 0.5
                result.at[0, case[c]] = 1

    return result


def make_X2input(input_list):
    law = ['가정폭력범죄의처벌등에관한특례법제63조제1항', '개인정보보호법제71조', '건설산업기본법제96조', '건축법제110조', '건축법제111조', '게임산업진흥에관한법률제32조제1항', '게임산업진흥에관한법률제44조제1항', '게임산업진흥에관한법률제44조제2항', '게임산업진흥에관한법률제45조', '경범죄처벌법제3조제3항', '계엄법제13조', '계엄법제15조', '고용보험법제116조제2항', '공공기관의운영에관한법률제53조', '공공단체등위탁선거에관한법률제58조', '공인중개사법제49조제1항', '공직선거법제112조제1항', '공직선거법제112조제2항', '공직선거법제113조', '공직선거법제113조제1항', '공직선거법제115조', '공직선거법제18조제3항', '공직선거법제230조제1항', '공직선거법제230조제2항', '공직선거법제236조', '공직선거법제237조제1항', '공직선거법제240조제1항', '공직선거법제247조제1항', '공직선거법제250조제1항', '공직선거법제250조제2항', '공직선거법제250조제3항', '공직선거법제251조', '공직선거법제254조제2항', '공직선거법제255조제1항', '공직선거법제255조제2항', '공직선거법제255조제3항', '공직선거법제256조제2항', '공직선거법제256조제3항', '공직선거법제257조제1항', '공직선거법제257조제2항', '공직선거법제2조', '공직선거법제58조제1항', '공직선거법제93조제1항', '관세법제269조제2항', '관세법제271조제2항', '관세법제278조', '관세법제282조제2항', '관세법제282조제3항', '교통사고처리특례법제3조제1항', '교통사고처리특례법제3조제2항', '교통사고처리특례법제4조제1항', '국가공무원법제84조', '국가보안법제14조', '국가보안법제7조제1항', '국가보안법제7조제5항', '국가보안법제8조제1항', '국민체육진흥법제47조', '국민체육진흥법제48조', '국민체육진흥법제51조제1항', '국민체육진흥법제51조제3항', '군형법제92조', '근로기준법제107조', '근로기준법제109조제1항', '근로기준법제109조제2항', '근로기준법제110조', '근로자퇴직급여보장법제44조', '노동조합및노동관계조정법제2조', '노동조합및노동관계조정법제90조', '농수산물의원산지표시에관한법률제14조', '농수산물의원산지표시에관한법률제17조', '대기환경보전법제89조', '대기환경보전법제90조', '대기환경보전법제95조', '대부업등의등록및금융이용자보호에관한법률제19조제1항', '대부업등의등록및금융이용자보호에관한법률제19조제2항', '도로교통법제148조', '도로교통법제148조제1항', '도로교통법제148조제2항', '도로교통법제148조제3항', '도로교통법제150조', '도로교통법제151조', '도로교통법제152조', '도로교통법제154조', '도로교통법제2조', '도로교통법제44조제1항', '도로교통법제44조제2항', '도로교통법제50조제1항', '도로교통법제54조제1항', '독점규제및공정거래에관한법률제70조', '동물보호법제46조제1항', '마약류관리에관한법률제58조제1항', '마약류관리에관한법률제59조제1항', '마약류관리에관한법률제60조제1항', '마약류관리에관한법률제61조제1항', '마약류관리에관한법률제67조', '민법제756조', '민사소송법제420조', '방문판매등에관한법률제58조제1항', '범죄수익은닉의규제및처벌등에관한법률제10조제1항', '범죄수익은닉의규제및처벌등에관한법률제3조제1항', '법원조직법제32조제1항', '변호사법제109조', '변호사법제111조', '변호사법제111조제1항', '변호사법제116조', '병역법제86조', '병역법제88조제1항', '병역법제89조', '보건범죄단속에관한특별조치법제5조', '보조금관리에관한법률제40조', '보호관찰등에관한법률제59조', '보호관찰등에관한법률제59조제1항', '부정경쟁방지및영업비밀보호에관한법률제18조제2항', '부정경쟁방지및영업비밀보호에관한법률제2조', '산림보호법제53조제1항', '산업안전보건법제29조제1항', '산업안전보건법제66조', '산업안전보건법제67조', '산업안전보건법제68조', '산업안전보건법제71조', '산지관리법제53조', '상표법제93조', '상표법제97조제1항', '석유및석유대체연료사업법제44조', '석유및석유대체연료사업법제46조', '성매매알선등행위의처벌에관한법률제19조제1항', '성매매알선등행위의처벌에관한법률제19조제2항', '성매매알선등행위의처벌에관한법률제21조제1항', '성매매알선등행위의처벌에관한법률제25조', '성폭력범죄의처벌등에관한특례법제10조제1항', '성폭력범죄의처벌등에관한특례법제11조', '성폭력범죄의처벌등에관한특례법제12조', '성폭력범죄의처벌등에관한특례법제13조', '성폭력범죄의처벌등에관한특례법제13조제1항', '성폭력범죄의처벌등에관한특례법제14조', '성폭력범죄의처벌등에관한특례법제14조제1항', '성폭력범죄의처벌등에관한특례법제14조제2항', '성폭력범죄의처벌등에관한특례법제15조', '성폭력범죄의처벌등에관한특례법제16조제2항', '성폭력범죄의처벌등에관한특례법제16조제3항', '성폭력범죄의처벌등에관한특례법제16조제4항', '성폭력범죄의처벌등에관한특례법제32조', '성폭력범죄의처벌등에관한특례법제32조제1항', '성폭력범죄의처벌등에관한특례법제37조', '성폭력범죄의처벌등에관한특례법제37조제1항', '성폭력범죄의처벌등에관한특례법제3조제1항', '성폭력범죄의처벌등에관한특례법제3조제2항', '성폭력범죄의처벌등에관한특례법제41조', '성폭력범죄의처벌등에관한특례법제41조제1항', '성폭력범죄의처벌등에관한특례법제42조', '성폭력범죄의처벌등에관한특례법제42조제1항', '성폭력범죄의처벌등에관한특례법제43조', '성폭력범죄의처벌등에관한특례법제43조제1항', '성폭력범죄의처벌등에관한특례법제45조제1항', '성폭력범죄의처벌등에관한특례법제47조', '성폭력범죄의처벌등에관한특례법제47조제1항', '성폭력범죄의처벌등에관한특례법제49조제1항', '성폭력범죄의처벌등에관한특례법제4조제1항', '성폭력범죄의처벌등에관한특례법제5조', '성폭력범죄의처벌등에관한특례법제5조제1항', '성폭력범죄의처벌등에관한특례법제5조제2항', '성폭력범죄의처벌등에관한특례법제5조제3항', '성폭력범죄의처벌등에관한특례법제6조', '성폭력범죄의처벌등에관한특례법제6조제3항', '성폭력범죄의처벌등에관한특례법제6조제4항', '성폭력범죄의처벌등에관한특례법제6조제5항', '성폭력범죄의처벌등에관한특례법제7조제1항', '성폭력범죄의처벌등에관한특례법제7조제2항', '성폭력범죄의처벌등에관한특례법제7조제3항', '성폭력범죄의처벌등에관한특례법제7조제4항', '성폭력범죄의처벌등에관한특례법제7조제5항', '성폭력범죄의처벌등에관한특례법제8조제1항', '성폭력범죄의처벌등에관한특례법제9조제1항', '소년법제2조', '소년법제60조제3항', '소방기본법제50조', '소송촉진등에관한특례법제23조', '소송촉진등에관한특례법제25조제1항', '소송촉진등에관한특례법제25조제3항', '소송촉진등에관한특례법제31조제3항', '소송촉진등에관한특례법제32조제1항', '수산업법제97조제1항', '수산업법제98조', '수산자원관리법제64조', '수산자원관리법제65조', '수산자원관리법제68조제1항', '식품위생법시행령제21조', '식품위생법제100조', '식품위생법제94조', '식품위생법제94조제1항', '식품위생법제95조', '식품위생법제97조', '실종아동등의보호및지원에관한법률제17조', '아동ㆍ청소년의성보호에관한법률제21조제2항', '아동ㆍ청소년의성보호에관한법률제33조', '아동ㆍ청소년의성보호에관한법률제38조제1항', '아동ㆍ청소년의성보호에관한법률제49조제1항', '아동복지법제17조', '아동복지법제29조', '아동복지법제3조', '아동복지법제40조', '아동복지법제71조제1항', '아동복지법제72조', '아동복지법제74조', '아동학대범죄의처벌등에관한특례법제7조', '아동학대범죄의처벌등에관한특례법제8조제1항', '야생생물보호및관리에관한법률제69조제1항', '약사법제93조제1항', '여신전문금융업법제70조제1항', '외국환거래법제27조제1항', '위치정보의보호및이용등에관한법률제40조', '유사수신행위의규제에관한법률제6조제1항', '응급의료에관한법률제60조제1항', '의료법제27조', '의료법제27조제1항', '의료법제33조제2항', '의료법제87조제1항', '의료법제88조', '의료법제90조', '의료법제91조', '자동차관리법제2조', '자동차관리법제78조', '자동차관리법제80조', '자동차관리법제81조', '자동차손해배상보장법제46조제2항', '자본시장과금융투자업에관한법률제444조', '장애인복지법제59조제1항', '저작권법제136조제1항', '저작권법제141조', '저작권법제2조', '전기통신사업법제95조', '전기통신사업법제97조', '전자금융거래법제49조제4항', '전자금융거래법제49조제5항', '전자장치부착등에관한법률제13조제1항', '전자장치부착등에관한법률제21조', '전자장치부착등에관한법률제35조', '전자장치부착등에관한법률제38조', '전자장치부착등에관한법률제5조제1항', '전자장치부착등에관한법률제5조제3항', '전자장치부착등에관한법률제5조제4항', '전자장치부착등에관한법률제9조제1항', '전자장치부착등에관한법률제9조제4항', '정보통신망이용촉진및정보보호등에관한법률제70조', '정보통신망이용촉진및정보보호등에관한법률제70조제1항', '정보통신망이용촉진및정보보호등에관한법률제70조제2항', '정보통신망이용촉진및정보보호등에관한법률제71조', '정보통신망이용촉진및정보보호등에관한법률제72조제1항', '정보통신망이용촉진및정보보호등에관한법률제74조제1항', '정치자금법제45조제1항', '정치자금법제45조제2항', '정치자금법제45조제3항', '정치자금법제47조제1항', '정치자금법제49조제1항', '정치자금법제49조제2항', '조세범처벌법제10조제3항', '조세범처벌법제3조제1항', '주민등록법제37조', '주차장법제29조제1항', '주택법제96조', '지방공기업법제83조', '직업안정법제47조', '집회및시위에관한법률제22조제2항', '집회및시위에관한법률제24조', '집회및시위에관한법률제6조제1항', '채권의공정한추심에관한법률제15조제1항', '출입국관리법제94조', '치료감호등에관한법률제12조제1항', '치료감호등에관한법률제2조제1항', '통신비밀보호법제16조제1항', '특정강력범죄의처벌에관한특례법제3조', '특정강력범죄의처벌에관한특례법제4조제2항', '특정경제범죄가중처벌등에관한법률제10조제3항', '특정경제범죄가중처벌등에관한법률제3조', '특정경제범죄가중처벌등에관한법률제3조제1항', '특정경제범죄가중처벌등에관한법률제5조제4항', '특정경제범죄가중처벌등에관한법률제7조', '특정범죄가중처벌등에관한법률제10조', '특정범죄가중처벌등에관한법률제13조', '특정범죄가중처벌등에관한법률제2조제1항', '특정범죄가중처벌등에관한법률제2조제2항', '특정범죄가중처벌등에관한법률제3조', '특정범죄가중처벌등에관한법률제4조', '특정범죄가중처벌등에관한법률제5조', '특정범죄가중처벌등에관한법률제5조제1항', '특정범죄가중처벌등에관한법률제5조제2항', '특정범죄가중처벌등에관한법률제5조제5항', '특정범죄가중처벌등에관한법률제5조제6항', '특정범죄가중처벌등에관한법률제8조제1항', '특정범죄자에대한보호관찰및전자장치부착등에관한법률제21조', '특정범죄자에대한보호관찰및전자장치부착등에관한법률제35조', '특정범죄자에대한보호관찰및전자장치부착등에관한법률제38조', '특정범죄자에대한보호관찰및전자장치부착등에관한법률제5조제1항', '특정범죄자에대한보호관찰및전자장치부착등에관한법률제5조제3항', '특정범죄자에대한보호관찰및전자장치부착등에관한법률제5조제4항', '특정범죄자에대한보호관찰및전자장치부착등에관한법률제9조제1항', '특정범죄자에대한보호관찰및전자장치부착등에관한법률제9조제4항', '폐기물관리법제63조', '폐기물관리법제66조', '폭력행위등처벌에관한법률제2조제1항', '폭력행위등처벌에관한법률제2조제2항', '폭력행위등처벌에관한법률제2조제3항', '폭력행위등처벌에관한법률제3조제1항', '폭력행위등처벌에관한법률제3조제4항', '폭력행위등처벌에관한법률제4조제1항', '폭력행위등처벌에관한법률제6조', '폭력행위등처벌에관한법률제7조', '한국마사회법제50조', '한국마사회법제50조제1항', '한국마사회법제56조', '해양환경관리법제127조', '행정절차법제21조', '행정절차법제21조제1항', '행정절차법제21조제4항', '형법제10조', '형법제10조제1항', '형법제10조제2항', '형법제10조제3항', '형법제118조', '형법제122조', '형법제123조', '형법제125조', '형법제127조', '형법제129조', '형법제129조제1항', '형법제130조', '형법제131조제1항', '형법제131조제2항', '형법제132조', '형법제133조제1항', '형법제133조제2항', '형법제134조', '형법제136조', '형법제136조제1항', '형법제137조', '형법제141조제1항', '형법제144조제1항', '형법제144조제2항', '형법제151조제1항', '형법제152조제1항', '형법제153조', '형법제155조제1항', '형법제156조', '형법제157조', '형법제161조제1항', '형법제164조제1항', '형법제164조제2항', '형법제166조제1항', '형법제167조제1항', '형법제16조', '형법제171조', '형법제174조', '형법제175조', '형법제185조', '형법제189조제2항', '형법제1조제1항', '형법제207조제1항', '형법제20조', '형법제217조', '형법제21조', '형법제21조제1항', '형법제225조', '형법제227조', '형법제228조제1항', '형법제228조제2항', '형법제229조', '형법제22조제1항', '형법제230조', '형법제231조', '형법제232조', '형법제233조', '형법제234조', '형법제238조제1항', '형법제238조제2항', '형법제239조제1항', '형법제239조제2항', '형법제241조제1항', '형법제245조', '형법제246조제1항', '형법제246조제2항', '형법제247조', '형법제250조', '형법제250조제1항', '형법제250조제2항', '형법제251조', '형법제252조제2항', '형법제254조', '형법제255조', '형법제257조', '형법제257조제1항', '형법제257조제2항', '형법제258조', '형법제258조제1항', '형법제258조제2항', '형법제259조제1항', '형법제25조제2항', '형법제260조', '형법제260조제1항', '형법제260조제2항', '형법제260조제3항', '형법제261조', '형법제262조', '형법제266조제1항', '형법제267조', '형법제268조', '형법제26조', '형법제270조제1항', '형법제275조제1항', '형법제276조제1항', '형법제278조', '형법제281조제1항', '형법제283조', '형법제283조제1항', '형법제283조제2항', '형법제283조제3항', '형법제284조', '형법제287조', '형법제288조제1항', '형법제297조', '형법제298조', '형법제299조', '형법제300조', '형법제301조', '형법제302조', '형법제305조', '형법제307조제1항', '형법제307조제2항', '형법제309조제2항', '형법제30조', '형법제310조', '형법제311조', '형법제314조', '형법제314조제1항', '형법제314조제2항', '형법제315조', '형법제319조', '형법제319조제1항', '형법제319조제2항', '형법제31조제1항', '형법제320조', '형법제324조', '형법제324조제1항', '형법제325조', '형법제327조', '형법제329조', '형법제32조', '형법제32조제1항', '형법제32조제2항', '형법제330조', '형법제331조', '형법제331조제1항', '형법제331조제2항', '형법제332조', '형법제333조', '형법제334조', '형법제334조제1항', '형법제334조제2항', '형법제335조', '형법제337조', '형법제338조', '형법제33조', '형법제342조', '형법제343조', '형법제347조', '형법제347조제1항', '형법제347조제2항', '형법제348조', '형법제350조', '형법제350조제1항', '형법제351조', '형법제352조', '형법제354조', '형법제355조제1항', '형법제355조제2항', '형법제356조', '형법제357조', '형법제357조제1항', '형법제357조제2항', '형법제357조제3항', '형법제35조', '형법제360조제1항', '형법제362조제1항', '형법제364조', '형법제366조', '형법제369조제1항', '형법제37조', '형법제38조', '형법제38조제1항', '형법제39조', '형법제39조제1항', '형법제40조', '형법제42조', '형법제48조', '형법제48조제1항', '형법제48조제2항', '형법제51조', '형법제52조제1항', '형법제53조', '형법제55조제1항', '형법제57조', '형법제58조', '형법제58조제2항', '형법제59조제1항', '형법제62조', '형법제62조제1항', '형법제62조제2항', '형법제69조제2항', '형법제70조', '형법제70조제1항', '형법제77조', '형법제8조', '형법제92조', '형사소송규칙제25조', '형사소송규칙제25조제1항', '형사소송법제186조제1항', '형사소송법제199조제1항', '형사소송법제218조', '형사소송법제249조제1항', '형사소송법제254조제4항', '형사소송법제262조제2항', '형사소송법제308조', '형사소송법제309조', '형사소송법제310조', '형사소송법제312조', '형사소송법제312조제3항', '형사소송법제313조', '형사소송법제314조', '형사소송법제315조', '형사소송법제316조제1항', '형사소송법제316조제2항', '형사소송법제325조', '형사소송법제326조', '형사소송법제327조', '형사소송법제333조제1항', '형사소송법제333조제2항', '형사소송법제334조제1항', '형사소송법제364조', '형사소송법제364조제2항', '형사소송법제364조제4항', '형사소송법제364조제6항', '형사소송법제366조', '형사소송법제369조', '형사소송법제420조', '형사소송법제422조', '형사소송법제435조제1항', '형사소송법제440조', '화학물질관리법제59조']
    result = pd.DataFrame(0, index=np.arange(1), columns=law)
    for i in input_list:
        for l in range(len(law)):
            if i.replace(' ', '') == law[l]:
                result.at[0, law[l]] = 1

    return result


def make_X3input(input_list):
    mecab = Mecab()
    result = str()
    for i in input_list.split():
        if len(i) > 1 and i.isalpha():
            i = i.replace('설령', '가사').replace('고려', '감안').replace('생각', '감안').replace('참작', '감안')
            i = i.replace('거치지', '걷히지').replace('걷잡을', '겉잡을').replace('매각', '경락').replace('매수인', '경락인')
            i = i.replace('마쳐졌다', '경료되었다').replace('돈', '금원').replace('금액', '금원').replace('이미', '기')
            i = i.replace('속여', '기망하여').replace('빌미로', '기화로').replace('까다롭다', '까닭스럽다')
            i = i.replace('까다롭다', '까탈스럽다').replace('난이도', '난도').replace('이해', '납득')
            i = i.replace('명세', '내역').replace('내비게이션', '네비게이션').replace('많은 금액', '다액').replace('많은 돈', '다액').replace('큰돈', '다액')
            i = i.replace('큰 액수', '다액').replace('해당', '당해').replace('넘겨', '도과하여').replace('경과한 것으로서', '도과한 것으로서')
            i = i.replace('튀통수치다', '뒤꼭지치다').replace('개인지도', '레슨').replace('렌터카', '렌트카').replace('맞히다', '맞추다')
            i = i.replace('실어내기', '반출하기').replace('발송하다', '발하다').replace('발표하다', '발하다').replace('함께', '병합하여').replace('보도블록', '보도블럭')
            i = i.replace('일반인', '보통인').replace('알 수 없는 방법으로', '불상의 방법으로').replace('포함하다', '산입').replace('타당하다', '상당하다')
            i = i.replace('알맞다', '상당하다').replace('잃게', '상실하게').replace('남아', '상존하고')
            i = i.replace('성립여부', '성부').replace('이른바', '소위').replace('받는', '송금받는').replace('수수한', '수수받은')
            i = i.replace('여러차례', '수회').replace('잠금장치', '시건장치').replace('잠긴 문', '시정된 문').replace('일정한 비율에 따라 나누어','안분하여')
            i = i.replace('한지 그렇지 않은지', '여부').replace('두려움을 느낀', '외포된').replace('배서하여', '이서하여').replace('넘겨', '이첩')
            i = i.replace('한때', '일시적').replace('담보권 실행을 위한 경매', '임의경매실행').replace('인정', '자인').replace('옮겨','전원하여').replace('저해', '조해').replace('존재 여부', '존부')
            i = i.replace('근거한', '터 잡은').replace('피시방', '피씨방').replace('반드시', '필요적으로').replace('휴대전화', '휴대폰').replace('휴대전화', '핸드폰').replace('부족', '흠결')
            i = i.replace('모자람', '흠결').replace('흠', '흠결').replace('빈집터', '나대지').a.replace('피고에게', '피고에 대하여').a.replace('쌓아놓다', '적치하다').a.replace('음주운전', '주취운전')

            if mecab.nouns(i):
                result = result + " " + i if result else i

    max_features = 30000
    sequence_length = 256

    tokenizer = Tokenizer(num_words=max_features, split=' ', oov_token='<unw>')
    tokenizer.fit_on_texts(result)

    result = tokenizer.texts_to_sequences(result)
    result = pad_sequences(result, sequence_length)

    return result